const ability = [
    {
        name: "우정의 유대",
        desc: "전투 진입 시 주위 3칸 내 아군 부대가 있을 경우 100% 확률로 공격, 방어 +20%."
    },
    {
        name: "딴지 걸기",
        desc: "행동 종료 시 주위 4칸 내 4기 적군 부대에게 무작위 디버프 1개 부여. 동시에 생명이 제일 낮은 다른 아군 부대의 생명을 아멜다 지력의 2.5배만큼 회복"
    },
    {
        name: "굳센 반격",
        desc: "공격을 받아 전투 진입 시 전투 후 100% 확률로 자신의 공격,방어 +10%, 2턴 지속, 최대 3회 누적가능."
    },
    {
        name: "圣洁的修女",
        desc: "行动结束时驱散1格内其他友军1个弱化效果并治疗生命值，治疗量为自身智力的1.5倍。"
    },
    {
        name: "传说的骑士",
        desc: "每移动1格，伤害提升1%，防御提升5%，攻击后，可以再次移动3格。"
    },
    {
        name: "王者的意志",
        desc: "遭受所有伤害降低5%，英雄生命100%以上被近战攻击进入战斗时，可以攻击2次。"
    }
]
