const ability = [
    {
        name: "우정의 유대",
        desc: "전투 진입 시 주위 3칸 내 아군 부대가 있을 경우 100% 확률로 공격, 방어 +20%."
    },
    {
        name: "落跑的公主",
        desc: "周为2格没有友军时，遭受所有伤害降低10% 击杀敌军后，可以额外行动1次，该效果需要间隔4回合才可以再次触发。"
    },
    {
        name: "风之守护",
        desc: "魔防提升10%，周围2格友军遭受魔法伤害降低15%。"
    },
    {
        name: "圣洁的修女",
        desc: "行动结束时驱散1格内其他友军1个弱化效果并治疗生命值，治疗量为自身智力的1.5倍。"
    },
    {
        name: "传说的骑士",
        desc: "每移动1格，伤害提升1%，防御提升5%，攻击后，可以再次移动3格。"
    },
    {
        name: "王者的意志",
        desc: "遭受所有伤害降低5%，英雄生命100%以上被近战攻击进入战斗时，可以攻击2次。"
    }
]
